{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 151], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu", "inbound_nodes": [[["gaussian_dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_1", "inbound_nodes": [[["layer_normalization_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_14", "inbound_nodes": [[["gaussian_dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["re_lu_14", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_6", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_6", "inbound_nodes": [[["gaussian_dropout_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_15", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_15", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["re_lu_6", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_15", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_15", "inbound_nodes": [[["layer_normalization_15", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_7", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_7", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_17", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_7", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_7", "inbound_nodes": [[["layer_normalization_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["re_lu_17", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_7", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_7", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_18", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_18", "inbound_nodes": [[["dense_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["re_lu_7", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_18", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_18", "inbound_nodes": [[["layer_normalization_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_51", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_51", "op": "Mul", "input": ["mul_51/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.3826789855957031}}, "name": "tf_op_layer_mul_51", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_10", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_10", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_8", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_8", "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_51", "trainable": true, "dtype": "float32", "node_def": {"name": "add_51", "op": "AddV2", "input": ["add_51/x", "mul_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_51", "inbound_nodes": [[["tf_op_layer_mul_51", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_52", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_52", "op": "Mul", "input": ["mul_52/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.47489672899246216}}, "name": "tf_op_layer_mul_52", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["re_lu_10", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_8", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_8", "inbound_nodes": [[["layer_normalization_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_52", "trainable": true, "dtype": "float32", "node_def": {"name": "add_52", "op": "AddV2", "input": ["add_51", "mul_52"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_52", "inbound_nodes": [[["tf_op_layer_add_51", 0, 0, {}], ["tf_op_layer_mul_52", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3", "inbound_nodes": [[["gaussian_dropout_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_2", "op": "Mul", "input": ["mul_2/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5275805592536926}}, "name": "tf_op_layer_mul_2", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_11", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_11", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_22", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_22", "inbound_nodes": [[["tf_op_layer_add_52", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_2", "inbound_nodes": [[["gaussian_dropout_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_2", "trainable": true, "dtype": "float32", "node_def": {"name": "add_2", "op": "AddV2", "input": ["add_2/x", "mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_2", "inbound_nodes": [[["tf_op_layer_mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_3", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_3", "op": "Mul", "input": ["mul_3/x", "gaussian_dropout_8/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.23099486529827118}}, "name": "tf_op_layer_mul_3", "inbound_nodes": [[["gaussian_dropout_8", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_11", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_11", "inbound_nodes": [[["layer_normalization_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_23", "inbound_nodes": [[["re_lu_22", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_4", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_3", "trainable": true, "dtype": "float32", "node_def": {"name": "add_3", "op": "AddV2", "input": ["add_2", "mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_3", "inbound_nodes": [[["tf_op_layer_add_2", 0, 0, {}], ["tf_op_layer_mul_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_86", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_86", "op": "Mul", "input": ["mul_86/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5327141880989075}}, "name": "tf_op_layer_mul_86", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_10", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_10", "op": "Mul", "input": ["mul_10/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.24428889155387878}}, "name": "tf_op_layer_mul_10", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_23", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_23", "inbound_nodes": [[["dense_23", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_4", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_4", "inbound_nodes": [[["layer_normalization_4", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_8", "inbound_nodes": [[["tf_op_layer_add_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_86", "trainable": true, "dtype": "float32", "node_def": {"name": "add_86", "op": "AddV2", "input": ["add_86/x", "mul_86"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_86", "inbound_nodes": [[["tf_op_layer_mul_86", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_87", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_87", "op": "Mul", "input": ["mul_87/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.35819438099861145}}, "name": "tf_op_layer_mul_87", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_28", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_28", "op": "Mul", "input": ["mul_28/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.46040788292884827}}, "name": "tf_op_layer_mul_28", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_10", "trainable": true, "dtype": "float32", "node_def": {"name": "add_10", "op": "AddV2", "input": ["add_10/x", "mul_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_10", "inbound_nodes": [[["tf_op_layer_mul_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_11", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_11", "op": "Mul", "input": ["mul_11/x", "gaussian_dropout_11/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5772800445556641}}, "name": "tf_op_layer_mul_11", "inbound_nodes": [[["gaussian_dropout_11", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_23", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_23", "inbound_nodes": [[["layer_normalization_23", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_3", "inbound_nodes": [[["layer_normalization_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul", "trainable": true, "dtype": "float32", "node_def": {"name": "mul", "op": "Mul", "input": ["mul/x", "gaussian_dropout_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.7550883293151855}}, "name": "tf_op_layer_mul", "inbound_nodes": [[["gaussian_dropout_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["re_lu_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_87", "trainable": true, "dtype": "float32", "node_def": {"name": "add_87", "op": "AddV2", "input": ["add_86", "mul_87"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_87", "inbound_nodes": [[["tf_op_layer_add_86", 0, 0, {}], ["tf_op_layer_mul_87", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_88", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_88", "op": "Mul", "input": ["mul_88/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.42299684882164}}, "name": "tf_op_layer_mul_88", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_28", "trainable": true, "dtype": "float32", "node_def": {"name": "add_28", "op": "AddV2", "input": ["add_28/x", "mul_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_28", "inbound_nodes": [[["tf_op_layer_mul_28", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_29", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_29", "op": "Mul", "input": ["mul_29/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.6789646744728088}}, "name": "tf_op_layer_mul_29", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_11", "trainable": true, "dtype": "float32", "node_def": {"name": "add_11", "op": "AddV2", "input": ["add_10", "mul_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_11", "inbound_nodes": [[["tf_op_layer_add_10", 0, 0, {}], ["tf_op_layer_mul_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_103", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_103", "op": "Mul", "input": ["mul_103/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.47659844160079956}}, "name": "tf_op_layer_mul_103", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add", "trainable": true, "dtype": "float32", "node_def": {"name": "add", "op": "AddV2", "input": ["add/x", "mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add", "inbound_nodes": [[["tf_op_layer_mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_1", "op": "Mul", "input": ["mul_1/x", "gaussian_dropout_3/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.7709020972251892}}, "name": "tf_op_layer_mul_1", "inbound_nodes": [[["gaussian_dropout_3", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_9", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_9", "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_88", "trainable": true, "dtype": "float32", "node_def": {"name": "add_88", "op": "AddV2", "input": ["add_87", "mul_88"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_88", "inbound_nodes": [[["tf_op_layer_add_87", 0, 0, {}], ["tf_op_layer_mul_88", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_89", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_89", "op": "Mul", "input": ["mul_89/x", "gaussian_dropout_23/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5584985017776489}}, "name": "tf_op_layer_mul_89", "inbound_nodes": [[["gaussian_dropout_23", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_29", "trainable": true, "dtype": "float32", "node_def": {"name": "add_29", "op": "AddV2", "input": ["add_28", "mul_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_29", "inbound_nodes": [[["tf_op_layer_add_28", 0, 0, {}], ["tf_op_layer_mul_29", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_30", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_30", "op": "Mul", "input": ["mul_30/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.4919140934944153}}, "name": "tf_op_layer_mul_30", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_12", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_12", "inbound_nodes": [[["tf_op_layer_add_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_103", "trainable": true, "dtype": "float32", "node_def": {"name": "add_103", "op": "AddV2", "input": ["add_103/x", "mul_103"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_103", "inbound_nodes": [[["tf_op_layer_mul_103", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_104", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_104", "op": "Mul", "input": ["mul_104/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.6249055862426758}}, "name": "tf_op_layer_mul_104", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_130", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_130", "op": "Mul", "input": ["mul_130/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.4707128405570984}}, "name": "tf_op_layer_mul_130", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "add_1", "op": "AddV2", "input": ["add", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_1", "inbound_nodes": [[["tf_op_layer_add", 0, 0, {}], ["tf_op_layer_mul_1", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_9", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_9", "inbound_nodes": [[["layer_normalization_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_89", "trainable": true, "dtype": "float32", "node_def": {"name": "add_89", "op": "AddV2", "input": ["add_88", "mul_89"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_89", "inbound_nodes": [[["tf_op_layer_add_88", 0, 0, {}], ["tf_op_layer_mul_89", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_90", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_90", "op": "Mul", "input": ["mul_90/x", "gaussian_dropout_8/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5317879319190979}}, "name": "tf_op_layer_mul_90", "inbound_nodes": [[["gaussian_dropout_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_30", "trainable": true, "dtype": "float32", "node_def": {"name": "add_30", "op": "AddV2", "input": ["add_29", "mul_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_30", "inbound_nodes": [[["tf_op_layer_add_29", 0, 0, {}], ["tf_op_layer_mul_30", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_31", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_31", "op": "Mul", "input": ["mul_31/x", "gaussian_dropout_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.6570801734924316}}, "name": "tf_op_layer_mul_31", "inbound_nodes": [[["gaussian_dropout_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["re_lu_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_104", "trainable": true, "dtype": "float32", "node_def": {"name": "add_104", "op": "AddV2", "input": ["add_103", "mul_104"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_104", "inbound_nodes": [[["tf_op_layer_add_103", 0, 0, {}], ["tf_op_layer_mul_104", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_105", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_105", "op": "Mul", "input": ["mul_105/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.524253785610199}}, "name": "tf_op_layer_mul_105", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_130", "trainable": true, "dtype": "float32", "node_def": {"name": "add_130", "op": "AddV2", "input": ["add_130/x", "mul_130"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_130", "inbound_nodes": [[["tf_op_layer_mul_130", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_131", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_131", "op": "Mul", "input": ["mul_131/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.6055951118469238}}, "name": "tf_op_layer_mul_131", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_4", "inbound_nodes": [[["tf_op_layer_add_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_90", "trainable": true, "dtype": "float32", "node_def": {"name": "add_90", "op": "AddV2", "input": ["add_89", "mul_90"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_90", "inbound_nodes": [[["tf_op_layer_add_89", 0, 0, {}], ["tf_op_layer_mul_90", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_91", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_91", "op": "Mul", "input": ["mul_91/x", "gaussian_dropout_9/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.3996225893497467}}, "name": "tf_op_layer_mul_91", "inbound_nodes": [[["gaussian_dropout_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_31", "trainable": true, "dtype": "float32", "node_def": {"name": "add_31", "op": "AddV2", "input": ["add_30", "mul_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_31", "inbound_nodes": [[["tf_op_layer_add_30", 0, 0, {}], ["tf_op_layer_mul_31", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_13", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_13", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_105", "trainable": true, "dtype": "float32", "node_def": {"name": "add_105", "op": "AddV2", "input": ["add_104", "mul_105"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_105", "inbound_nodes": [[["tf_op_layer_add_104", 0, 0, {}], ["tf_op_layer_mul_105", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_106", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_106", "op": "Mul", "input": ["mul_106/x", "gaussian_dropout_23/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.4375976622104645}}, "name": "tf_op_layer_mul_106", "inbound_nodes": [[["gaussian_dropout_23", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_131", "trainable": true, "dtype": "float32", "node_def": {"name": "add_131", "op": "AddV2", "input": ["add_130", "mul_131"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_131", "inbound_nodes": [[["tf_op_layer_add_130", 0, 0, {}], ["tf_op_layer_mul_131", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_132", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_132", "op": "Mul", "input": ["mul_132/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.565119743347168}}, "name": "tf_op_layer_mul_132", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_4", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_4", "op": "Mul", "input": ["mul_4/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.38684847950935364}}, "name": "tf_op_layer_mul_4", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["re_lu_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_91", "trainable": true, "dtype": "float32", "node_def": {"name": "add_91", "op": "AddV2", "input": ["add_90", "mul_91"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_91", "inbound_nodes": [[["tf_op_layer_add_90", 0, 0, {}], ["tf_op_layer_mul_91", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_18", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_18", "inbound_nodes": [[["tf_op_layer_add_31", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_13", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_13", "inbound_nodes": [[["layer_normalization_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_12", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_12", "op": "Mul", "input": ["mul_12/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5771715641021729}}, "name": "tf_op_layer_mul_12", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_113", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_113", "op": "Mul", "input": ["mul_113/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.4748528003692627}}, "name": "tf_op_layer_mul_113", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_5", "inbound_nodes": [[["gaussian_dropout_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_106", "trainable": true, "dtype": "float32", "node_def": {"name": "add_106", "op": "AddV2", "input": ["add_105", "mul_106"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_106", "inbound_nodes": [[["tf_op_layer_add_105", 0, 0, {}], ["tf_op_layer_mul_106", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_107", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_107", "op": "Mul", "input": ["mul_107/x", "gaussian_dropout_8/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.3930765986442566}}, "name": "tf_op_layer_mul_107", "inbound_nodes": [[["gaussian_dropout_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_32", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_32", "op": "Mul", "input": ["mul_32/x", "gaussian_dropout_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.4569651782512665}}, "name": "tf_op_layer_mul_32", "inbound_nodes": [[["gaussian_dropout_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_132", "trainable": true, "dtype": "float32", "node_def": {"name": "add_132", "op": "AddV2", "input": ["add_131", "mul_132"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_132", "inbound_nodes": [[["tf_op_layer_add_131", 0, 0, {}], ["tf_op_layer_mul_132", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_133", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_133", "op": "Mul", "input": ["mul_133/x", "gaussian_dropout_23/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5439748167991638}}, "name": "tf_op_layer_mul_133", "inbound_nodes": [[["gaussian_dropout_23", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_4", "trainable": true, "dtype": "float32", "node_def": {"name": "add_4", "op": "AddV2", "input": ["add_4/x", "mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_4", "inbound_nodes": [[["tf_op_layer_mul_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_5", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_5", "op": "Mul", "input": ["mul_5/x", "gaussian_dropout_8/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.7400376796722412}}, "name": "tf_op_layer_mul_5", "inbound_nodes": [[["gaussian_dropout_8", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_5", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_5", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_27", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_27", "inbound_nodes": [[["tf_op_layer_add_91", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["re_lu_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_12", "trainable": true, "dtype": "float32", "node_def": {"name": "add_12", "op": "AddV2", "input": ["add_12/x", "mul_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_12", "inbound_nodes": [[["tf_op_layer_mul_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_13", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_13", "op": "Mul", "input": ["mul_13/x", "gaussian_dropout_13/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.31139445304870605}}, "name": "tf_op_layer_mul_13", "inbound_nodes": [[["gaussian_dropout_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_113", "trainable": true, "dtype": "float32", "node_def": {"name": "add_113", "op": "AddV2", "input": ["add_113/x", "mul_113"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_113", "inbound_nodes": [[["tf_op_layer_mul_113", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_114", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_114", "op": "Mul", "input": ["mul_114/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5433685183525085}}, "name": "tf_op_layer_mul_114", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["re_lu_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_107", "trainable": true, "dtype": "float32", "node_def": {"name": "add_107", "op": "AddV2", "input": ["add_106", "mul_107"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_107", "inbound_nodes": [[["tf_op_layer_add_106", 0, 0, {}], ["tf_op_layer_mul_107", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_108", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_108", "op": "Mul", "input": ["mul_108/x", "gaussian_dropout_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5371639728546143}}, "name": "tf_op_layer_mul_108", "inbound_nodes": [[["gaussian_dropout_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_32", "trainable": true, "dtype": "float32", "node_def": {"name": "add_32", "op": "AddV2", "input": ["add_32/x", "mul_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_add_32", "inbound_nodes": [[["tf_op_layer_mul_32", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_33", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_33", "op": "Mul", "input": ["mul_33/x", "gaussian_dropout_18/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.6582098007202148}}, "name": "tf_op_layer_mul_33", "inbound_nodes": [[["gaussian_dropout_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_133", "trainable": true, "dtype": "float32", "node_def": {"name": "add_133", "op": "AddV2", "input": ["add_132", "mul_133"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_133", "inbound_nodes": [[["tf_op_layer_add_132", 0, 0, {}], ["tf_op_layer_mul_133", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_134", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_134", "op": "Mul", "input": ["mul_134/x", "gaussian_dropout_11/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5027037858963013}}, "name": "tf_op_layer_mul_134", "inbound_nodes": [[["gaussian_dropout_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_5", "trainable": true, "dtype": "float32", "node_def": {"name": "add_5", "op": "AddV2", "input": ["add_4", "mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_5", "inbound_nodes": [[["tf_op_layer_add_4", 0, 0, {}], ["tf_op_layer_mul_5", 0, 0, {}]]]}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout_5", "trainable": true, "dtype": "float32", "rate": 0.5}, "name": "gaussian_dropout_5", "inbound_nodes": [[["layer_normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["re_lu_27", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_19", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_19", "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_13", "trainable": true, "dtype": "float32", "node_def": {"name": "add_13", "op": "AddV2", "input": ["add_12", "mul_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_13", "inbound_nodes": [[["tf_op_layer_add_12", 0, 0, {}], ["tf_op_layer_mul_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_14", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_14", "op": "Mul", "input": ["mul_14/x", "gaussian_dropout_11/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.4023474454879761}}, "name": "tf_op_layer_mul_14", "inbound_nodes": [[["gaussian_dropout_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_114", "trainable": true, "dtype": "float32", "node_def": {"name": "add_114", "op": "AddV2", "input": ["add_113", "mul_114"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_114", "inbound_nodes": [[["tf_op_layer_add_113", 0, 0, {}], ["tf_op_layer_mul_114", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_115", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_115", "op": "Mul", "input": ["mul_115/x", "gaussian_dropout_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5914851427078247}}, "name": "tf_op_layer_mul_115", "inbound_nodes": [[["gaussian_dropout_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_6", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_6", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_108", "trainable": true, "dtype": "float32", "node_def": {"name": "add_108", "op": "AddV2", "input": ["add_107", "mul_108"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_108", "inbound_nodes": [[["tf_op_layer_add_107", 0, 0, {}], ["tf_op_layer_mul_108", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_109", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_109", "op": "Mul", "input": ["mul_109/x", "gaussian_dropout_3/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.5948804616928101}}, "name": "tf_op_layer_mul_109", "inbound_nodes": [[["gaussian_dropout_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_33", "trainable": true, "dtype": "float32", "node_def": {"name": "add_33", "op": "AddV2", "input": ["add_32", "mul_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_33", "inbound_nodes": [[["tf_op_layer_add_32", 0, 0, {}], ["tf_op_layer_mul_33", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_34", "trainable": true, "dtype": "float32", 